app/views/resources/index.html.erb

SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."resource_id" = ?  [["resource_id", 1]]
---
    </thead>
    <% resource.endpoints.each do |endpoint| %>