app/controllers/endpoints_controller.rb

  def index
    @endpoints = @project.endpoints.all
---
SELECT "endpoints".* FROM "endpoints"

  def create
    @endpoint = @project.endpoints.new(endpoint_params)

    respond_to do |format|
      if @endpoint.save
---
INSERT INTO "endpoints" ("created_at", "description", "method_type", "project_id", "resource_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @endpoint.update(endpoint_params)
---
UPDATE "endpoints" SET "description" = ?, "updated_at" = ? WHERE "endpoints"."id" = 1  [["description", "Get an user. mlml mm mmom jij ih hih ih ihi  hih ih ih ihi hih ih "], ["updated_at", Sun, 07 Jul 2013 17:04:21 UTC +00:00]]

  def destroy
    @endpoint.destroy
---
DELETE FROM "endpoints" WHERE "endpoints"."id" = ?  [["id", 14]]

    def set_endpoint
      @endpoint = @project.endpoints.find(params[:id])
---
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."project_id" = ? AND "endpoints"."id" = ? LIMIT 1  [["project_id", 1], ["id", "14"]]