app/controllers/endpoints_controller.rb

    def set_resource
      @resource = Resource.find(params[:resource_id])
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "5"]]