app/controllers/parameters_controller.rb

  def create
    @parameter = @endpoint.parameters.new(parameter_params)

    respond_to do |format|
      if @parameter.save
---
INSERT INTO "parameters" ("created_at", "description", "endpoint_id", "example_value", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_endpoint
      @project = Project.find(params[:project_id])
      @endpoint = @project.endpoints.find(params[:endpoint_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "endpoints".* FROM "endpoints" WHERE "endpoints"."project_id" = ? AND "endpoints"."id" = ? LIMIT 1  [["project_id", 1], ["id", "1"]]