app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_project
      #unless params[:id].is_a? Integer
      #  @project = Project.find_by name: params[:id]
      #else
        @project = Project.find(params[:id])