app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"
---
  def index
    @resources = @project.resources.all

INSERT INTO "resources" ("created_at", "description", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 12 Jul 2013 13:58:32 UTC +00:00], ["description", "The user of this app."], ["name", "User"], ["project_id", 1], ["updated_at", Fri, 12 Jul 2013 13:58:32 UTC +00:00]]
---
  def create
    @resource = @project.resources.new(resource_params)

    respond_to do |format|
      if @resource.save

SELECT "resources".* FROM "resources" WHERE "resources"."project_id" = ? AND "resources"."id" = ? LIMIT 1  [["project_id", 1], ["id", "20"]]
---
    def set_resource
      @resource = @project.resources.find(params[:id])